package tlit

import (
	"unicode"
)

// System of transliteration.
type System int

// Systems of transliteration.
const (
	Default System = iota
	DriversLicense
	GOST1971
	GOST2002B
	GOST2006
	Passport1997
	Passport2010
	Passport2013ICAO
	Telegram
	UkrainianStd
	UkrainianWeb
)

// Table of systems of transliteration.
//
// For details, see:
// https://en.wikipedia.org/w/index.php?oldid=654052082
// https://ru.wikipedia.org/w/index.php?oldid=69888406
// http://transliteration.ru
// https://uk.wikipedia.org/w/index.php?oldid=14861690
var tableTransliteration = map[System]map[rune]string{
	Default: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "Y", 'й': "y",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "H", 'х': "h",
		'Ц': "C", 'ц': "c",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Sch", 'щ': "sch",
		'Ъ': "", 'ъ': "",
		'Ы': "Y", 'ы': "y",
		'Ь': "", 'ь': "",
		'Э': "E", 'э': "e",
		'Ю': "Yu", 'ю': "yu",
		'Я': "Ya", 'я': "ya",
	},
	DriversLicense: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "Y", 'й': "y",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "Ts", 'ц': "ts",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shch", 'щ': "shch",
		'Ъ': "'", 'ъ': "'",
		'Ы': "Y", 'ы': "y",
		'Ь': "'", 'ь': "'",
		'Э': "E", 'э': "e",
		'Ю': "Yu", 'ю': "yu",
		'Я': "Ya", 'я': "ya",
	},
	GOST1971: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "Jo", 'ё': "jo",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "Jj", 'й': "jj",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "C", 'ц': "c",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shh", 'щ': "shh",
		'Ъ': "\"", 'ъ': "\"",
		'Ы': "Y", 'ы': "y",
		'Ь': "'", 'ь': "'",
		'Э': "Eh", 'э': "eh",
		'Ю': "Ju", 'ю': "ju",
		'Я': "Ja", 'я': "ja",
	},
	GOST2002B: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "Yo", 'ё': "yo",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "J", 'й': "j",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "X", 'х': "x",
		'Ц': "Cz", 'ц': "cz",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shh", 'щ': "shh",
		'Ъ': "\"", 'ъ': "\"",
		'Ы': "Y'", 'ы': "y'",
		'Ь': "'", 'ь': "'",
		'Э': "E", 'э': "e",
		'Ю': "Yu", 'ю': "yu",
		'Я': "Ya", 'я': "ya",
	},
	GOST2006: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "I", 'й': "i",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "Tc", 'ц': "tc",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shch", 'щ': "shch",
		'Ъ': "", 'ъ': "",
		'Ы': "Y", 'ы': "y",
		'Ь': "", 'ь': "",
		'Э': "E", 'э': "e",
		'Ю': "Iu", 'ю': "iu",
		'Я': "Ia", 'я': "ia",
	},
	Passport1997: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "Y", 'й': "y",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "Ts", 'ц': "ts",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shch", 'щ': "shch",
		'Ъ': "\"", 'ъ': "\"",
		'Ы': "Y", 'ы': "y",
		'Ь': "", 'ь': "",
		'Э': "E", 'э': "e",
		'Ю': "Yu", 'ю': "yu",
		'Я': "Ya", 'я': "ya",
	},
	Passport2010: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "I", 'й': "i",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "Tc", 'ц': "tc",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shch", 'щ': "shch",
		'Ъ': "", 'ъ': "",
		'Ы': "Y", 'ы': "y",
		'Ь': "", 'ь': "",
		'Э': "E", 'э': "e",
		'Ю': "Iu", 'ю': "iu",
		'Я': "Ia", 'я': "ia",
	},
	Passport2013ICAO: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "I", 'й': "i",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "Ts", 'ц': "ts",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shch", 'щ': "shch",
		'Ъ': "Ie", 'ъ': "ie",
		'Ы': "Y", 'ы': "y",
		'Ь': "", 'ь': "",
		'Э': "E", 'э': "e",
		'Ю': "Iu", 'ю': "iu",
		'Я': "Ia", 'я': "ia",
	},
	Telegram: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Ё': "E", 'ё': "e",
		'Ж': "J", 'ж': "j",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'Й': "I", 'й': "i",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "H", 'х': "h",
		'Ц': "C", 'ц': "c",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Sc", 'щ': "sc",
		'Ъ': "", 'ъ': "",
		'Ы': "Y", 'ы': "y",
		'Ь': "", 'ь': "",
		'Э': "E", 'э': "e",
		'Ю': "Iu", 'ю': "iu",
		'Я': "Ia", 'я': "ia",
	},
	UkrainianStd: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "H", 'г': "h",
		'Ґ': "G", 'ґ': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Є': "Ie", 'є': "ie",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "Y", 'и': "y",
		'І': "I", 'і': "i",
		'Ї': "I", 'ї': "i",
		'Й': "I", 'й': "i",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "Kh", 'х': "kh",
		'Ц': "Ts", 'ц': "ts",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Shch", 'щ': "shch",
		'Ь': "", 'ь': "",
		'Ю': "Iu", 'ю': "iu",
		'Я': "Ia", 'я': "ia",
		'\'': "",
	},
	UkrainianWeb: {
		'А': "A", 'а': "a",
		'Б': "B", 'б': "b",
		'В': "V", 'в': "v",
		'Г': "G", 'г': "g",
		'Ґ': "G", 'ґ': "g",
		'Д': "D", 'д': "d",
		'Е': "E", 'е': "e",
		'Є': "E", 'є': "e",
		'Ж': "Zh", 'ж': "zh",
		'З': "Z", 'з': "z",
		'И': "I", 'и': "i",
		'І': "I", 'і': "i",
		'Ї': "I", 'ї': "i",
		'Й': "Y", 'й': "y",
		'К': "K", 'к': "k",
		'Л': "L", 'л': "l",
		'М': "M", 'м': "m",
		'Н': "N", 'н': "n",
		'О': "O", 'о': "o",
		'П': "P", 'п': "p",
		'Р': "R", 'р': "r",
		'С': "S", 'с': "s",
		'Т': "T", 'т': "t",
		'У': "U", 'у': "u",
		'Ф': "F", 'ф': "f",
		'Х': "H", 'х': "h",
		'Ц': "C", 'ц': "c",
		'Ч': "Ch", 'ч': "ch",
		'Ш': "Sh", 'ш': "sh",
		'Щ': "Sch", 'щ': "sch",
		'Ь': "", 'ь': "",
		'Ю': "Iu", 'ю': "iu",
		'Я': "Ia", 'я': "ia",
		'\'': "",
	},
}

var tableVowels = map[rune]bool{
	'А': true, 'а': true,
	'Е': true, 'е': true,
	'Ё': true, 'ё': true,
	'И': true, 'и': true,
	'О': true, 'о': true,
	'У': true, 'у': true,
	'Ы': true, 'ы': true,
	'Э': true, 'э': true,
	'Ю': true, 'ю': true,
	'Я': true, 'я': true,
}

// It changes rule of transliteration for current rule
// in depends on system of transliteration and adjacent runes.
func fixRuleRune(rPrev, rCurr, rNext rune, sys System) (string, bool) {
	var s string

	if !(sys == DriversLicense || sys == GOST2002B || sys == Passport1997 || sys == UkrainianStd) {
		return s, false
	}

	upper := unicode.IsUpper(rCurr)
	rPrev, rCurr, rNext = unicode.ToLower(rPrev), unicode.ToLower(rCurr), unicode.ToLower(rNext)

	switch sys {
	case DriversLicense:
		switch {
		case rCurr == 'е':
			if rPrev == 0 || tableVowels[rPrev] || rPrev == 'ъ' || rPrev == 'ь' {
				s = "ye"
			}
		case rCurr == 'ё':
			if rPrev == 0 || tableVowels[rPrev] || rPrev == 'ъ' || rPrev == 'ь' {
				s = "yo"
			} else if !tableVowels[rPrev] && rPrev != 'ж' && rPrev != 'ч' && rPrev != 'ш' && rPrev != 'щ' {
				s = "ye"
			}
		case rCurr == 'и' && rPrev == 'ь':
			s = "yi"
		}
	case GOST2002B:
		switch {
		case rCurr == 'ц':
			if s, ok := tableTransliteration[sys][rNext]; ok {
				if r := unicode.ToLower([]rune(s)[0]); r == 'e' || r == 'i' || r == 'j' || r == 'y' {
					s = "c"
				}
			}
		}
	case Passport1997:
		switch {
		case rCurr == 'е' && rPrev == 'ь':
			s = "ye"
		}
	case UkrainianStd:
		switch {
		case rCurr == 'г' && rPrev == 'з':
			s = "gh"
		case rCurr == 'є' && rPrev == 0:
			s = "ye"
		case rCurr == 'ї' && rPrev == 0:
			s = "yi"
		case rCurr == 'й' && rPrev == 0:
			s = "y"
		case rCurr == 'ю' && rPrev == 0:
			s = "iu"
		case rCurr == 'я' && rPrev == 0:
			s = "ia"
		}
	}

	if len(s) > 0 && upper {
		[]rune(s)[0] = unicode.ToUpper([]rune(s)[0])
	}

	return s, len(s) > 0
}
